README.org
* SCAFF

Side-Channel Analysis Flexible Framework (SCAFF) is a Python library and
command-line tool to perform power or electromagnetic side-channel attacks.

* Installation

Installable using [[https://pypi.org/project/pip/][Pip]]:

#+begin_src bash :eval never
git clone https://github.com/pierreay/scaff.git
cd scaff && pip install --user .
#+end_src

Optionally, install [[https://github.com/pierreay/python_hel][Histogram Enumeration Library (HEL)]] for key estimation and
enumeration.

* Usage

TODO: Usage demonstration.

* Files

TODO: Link to main files.
