README.md

# Table of Contents

1.  [SCAFF](#org1a068ce)
2.  [Installation](#org8fbf3d1)
3.  [Usage](#orgce9ee10)
4.  [Files](#orgaaf4cc2)


<a id="org1a068ce"></a>

# SCAFF

Side-Channel Analysis Flexible Framework (SCAFF) is a Python library and
command-line tool to perform power or electromagnetic side-channel attacks.


<a id="org8fbf3d1"></a>

# Installation

Installable using [Pip](https://pypi.org/project/pip/):

    git clone https://github.com/pierreay/scaff.git
    cd scaff && pip install --user .

Optionally, install [Histogram Enumeration Library (HEL)](https://github.com/pierreay/python_hel) for key estimation and
enumeration.


<a id="orgce9ee10"></a>

# Usage

TODO: Usage demonstration.


<a id="orgaaf4cc2"></a>

# Files

TODO: Link to main files.

